{
    "add_cross_attention": false,
    "architectures": [
        "Qwen3VLForConditionalGeneration"
    ],
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "dtype": null,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "image_token_id": 151655,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "model_type": "qwen3_vl",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "quantization": {
        "group_size": 64,
        "bits": 4,
        "mode": "affine"
    },
    "quantization_config": {
        "group_size": 64,
        "bits": 4,
        "mode": "affine"
    },
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "text_config": {
        "vocab_size": 151936,
        "max_position_embeddings": 262144,
        "hidden_size": 2048,
        "intermediate_size": 6144,
        "num_hidden_layers": 28,
        "num_attention_heads": 16,
        "num_key_value_heads": 8,
        "head_dim": 128,
        "hidden_act": "silu",
        "initializer_range": 0.02,
        "rms_norm_eps": 1e-06,
        "use_cache": true,
        "rope_theta": 5000000,
        "rope_scaling": {
            "mrope_interleaved": true,
            "mrope_section": [
                24,
                20,
                20
            ],
            "rope_type": "default"
        },
        "attention_bias": false,
        "attention_dropout": 0.0,
        "return_dict": true,
        "output_hidden_states": false,
        "torchscript": false,
        "dtype": "bfloat16",
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "chunk_size_feed_forward": 0,
        "is_encoder_decoder": false,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "architectures": null,
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "task_specific_params": null,
        "problem_type": null,
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": 151643,
        "pad_token_id": null,
        "eos_token_id": 151645,
        "sep_token_id": null,
        "decoder_start_token_id": null,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "suppress_tokens": null,
        "begin_suppress_tokens": null,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "_name_or_path": "",
        "model_type": "qwen3_vl_text",
        "tf_legacy_loss": false,
        "use_bfloat16": false,
        "output_attentions": false
    },
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torchscript": false,
    "transformers_version": "4.57.1",
    "typical_p": 1.0,
    "use_bfloat16": false,
    "video_token_id": 151656,
    "vision_config": {
        "return_dict": true,
        "output_hidden_states": false,
        "torchscript": false,
        "dtype": null,
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "chunk_size_feed_forward": 0,
        "is_encoder_decoder": false,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "architectures": null,
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "task_specific_params": null,
        "problem_type": null,
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": null,
        "pad_token_id": null,
        "eos_token_id": null,
        "sep_token_id": null,
        "decoder_start_token_id": null,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "suppress_tokens": null,
        "begin_suppress_tokens": null,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "_name_or_path": "",
        "model_type": "qwen3_vl",
        "tf_legacy_loss": false,
        "use_bfloat16": false,
        "depth": 24,
        "hidden_size": 1024,
        "hidden_act": "gelu_pytorch_tanh",
        "intermediate_size": 4096,
        "num_heads": 16,
        "in_channels": 3,
        "patch_size": 16,
        "spatial_merge_size": 2,
        "temporal_patch_size": 2,
        "out_hidden_size": 2048,
        "num_position_embeddings": 2304,
        "initializer_range": 0.02,
        "deepstack_visual_indexes": [
            5,
            11,
            17
        ],
        "output_attentions": false
    },
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652
}